In [2]:
import pandas as pd

In [34]:
data = {'Name': ['Arpit','Manish','Joy','Rohit','Virat','Shreya'],
        'Age': [30, 35, 37, 33, 34, 30],
        'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
        'Designation': ['Engineer','Artist','Painter','Singer','Designer','Dancer']}




df = pd.DataFrame(data)
df

     Name  Age  Salary Designation
0   Arpit   30  100000    Engineer
1  Manish   35   93000      Artist
2     Joy   37   88000     Painter
3   Rohit   33  120000      Singer
4   Virat   34   94000    Designer
5  Shreya   30   95000      Dancer

In [ ]:
# Q1. Display the name and age of the employees where salary is less than mean salary

In [5]:
df.loc[ df['Salary'] < df['Salary'].mean(), ['Name','Age'] ]

     Name  Age
1  Manish   35
2     Joy   37
4   Virat   34
5  Shreya   30

In [6]:
## Richa 
mean = df['Salary'].mean()
#df['Name'][df['Salary']>mean]
df[['Age','Name']][df['Salary']<mean]

   Age    Name
1   35  Manish
2   37     Joy
4   34   Virat
5   30  Shreya

In [8]:
import numpy as np

In [9]:
## Sharanya
df.loc[(df['Salary'] < np.mean(df['Salary'])),['Name','Age']]

     Name  Age
1  Manish   35
2     Joy   37
4   Virat   34
5  Shreya   30

In [11]:
#Aryan 
import numpy as np
mn=np.mean(df.Salary)
print(df.Name[df.Salary<mn].values,df.Age[df.Salary<mn].values)

['Manish' 'Joy' 'Virat' 'Shreya'] [35 37 34 30]

In [12]:
#Aditya 
a = df['Salary'].mean()
c = df['Name'].count()
for i in range(c):
    if(df['Salary'][i]<a):
        print(df['Name'][i])
        print(df['Age'][i])

Manish
35
Joy
37
Virat
34
Shreya
30

In [13]:
df

     Name  Age  Salary Designation
0   Arpit   30  100000    Engineer
1  Manish   35   93000      Artist
2     Joy   37   88000     Painter
3   Rohit   33  120000      Singer
4   Virat   34   94000    Designer
5  Shreya   30   95000      Dancer

In [ ]:
#Q2. Display the name and age of the employees where salary is >100000 & Age is less than 40

In [14]:
# Sharanya 
df.loc[(df['Salary'] > 100000) & (df['Age'] < 40),['Name','Age']]

    Name  Age
3  Rohit   33

In [16]:
# Atul 

df.loc[df['Salary']>100000 and df['Age']<40,['Name','Age']]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
# Mahesh
Df.loc[df[‘Salary’] > 100000 and df[‘Age’] < 40 , [‘name’, ‘age’]]

In [19]:
# Aryan
df.loc[df.Salary>100000].loc[df.Age<40,['Name','Age']]

    Name  Age
3  Rohit   33

In [20]:
# Aditya 
a = df.loc[(df['Salary']>100000)&(df['Age']<40),['Name','Age']]
a

    Name  Age
3  Rohit   33

In [22]:
df

     Name  Age  Salary Designation
0   Arpit   30  100000    Engineer
1  Manish   35   93000      Artist
2     Joy   37   88000     Painter
3   Rohit   33  120000      Singer
4   Virat   34   94000    Designer
5  Shreya   30   95000      Dancer

In [ ]:
# Q3. Need to create a new column, 'Salary_5' - 1.5 times of the current salary.

In [23]:
# Aditya
df['Salary_5'] = 1.5*df['Salary']
df

     Name  Age  Salary Designation  Salary_5
0   Arpit   30  100000    Engineer  150000.0
1  Manish   35   93000      Artist  139500.0
2     Joy   37   88000     Painter  132000.0
3   Rohit   33  120000      Singer  180000.0
4   Virat   34   94000    Designer  141000.0
5  Shreya   30   95000      Dancer  142500.0

In [24]:
# Aryan 
df["Salary_5"]= df.Salary*1.5
df

     Name  Age  Salary Designation  Salary_5
0   Arpit   30  100000    Engineer  150000.0
1  Manish   35   93000      Artist  139500.0
2     Joy   37   88000     Painter  132000.0
3   Rohit   33  120000      Singer  180000.0
4   Virat   34   94000    Designer  141000.0
5  Shreya   30   95000      Dancer  142500.0

In [25]:
# Tejaswini 
df['Salary_5'] = 1.5*df['Salary']

In [29]:
df

     Name  Age  Salary Designation
0   Arpit   30  100000    Engineer
1  Manish   35   93000      Artist
2     Joy   37   88000     Painter
3   Rohit   33  120000      Singer
4   Virat   34   94000    Designer
5  Shreya   30   95000      Dancer

In [36]:
# Mahesh 
#df['Salary_5'] = df.apply(lambda  x : x['Salary'] * 1.5, axis = 1)
#KeyError: 'Salary'

df['Salary_5'] = df['Salary'].apply(lambda  x : x * 1.5)
#TypeError: 'int' object is not subscriptable

In [38]:
df

     Name  Age  Salary Designation  Salary_5
0   Arpit   30  100000    Engineer  150000.0
1  Manish   35   93000      Artist  139500.0
2     Joy   37   88000     Painter  132000.0
3   Rohit   33  120000      Singer  180000.0
4   Virat   34   94000    Designer  141000.0
5  Shreya   30   95000      Dancer  142500.0

In [ ]:
# Q4. Display the name and Designation of employee having the second highest salary ?

In [39]:
# Richa 
sec_sal = sorted(df['Salary'])[-2]
df.loc[df['Salary']==sec_sal ,('Name','Designation')]

    Name Designation
0  Arpit    Engineer

In [46]:
# Mahesh 
#np.sort('Salary' , axis = 1)

In [47]:
# Aditya 
a = df.sort_values(by=['Salary'],ascending=False)  ## sorting in descending
a.head(2)
# df.loc[(df['Salary']==a),['Name','Designation']]

    Name  Age  Salary Designation  Salary_5
3  Rohit   33  120000      Singer  180000.0
0  Arpit   30  100000    Engineer  150000.0

In [48]:
# Aryan 
mx=df.Salary.max()

for i in df.Salary:
    if i<mx:
        mx=i
        for j in df.Salary[:1]:
            if j>mx:
                mx=j
df.loc[df.Salary==mx,['Name','Designation']]

    Name Designation
0  Arpit    Engineer

In [72]:
pd.DataFrame(df.sort_values(by=['Salary'],ascending=False).reset_index(drop=True).loc[1,['Name','Designation']]).T

    Name Designation
1  Arpit    Engineer

In [62]:
df

     Name  Age  Salary Designation  Salary_5
0   Arpit   30  100000    Engineer  150000.0
1  Manish   35   93000      Artist  139500.0
2     Joy   37   88000     Painter  132000.0
3   Rohit   33  120000      Singer  180000.0
4   Virat   34   94000    Designer  141000.0
5  Shreya   30   95000      Dancer  142500.0

In [64]:
max(df['Salary'])

120000

In [61]:
#Atul 

df.Salary.pop()

KeyError: 120000